Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP512MC202.h
extern volatile IC2CON1BITS IC2CON1bits __attribute__((__sfr__));

#define IC2CON2 IC2CON2
extern volatile unsigned int  IC2CON2 __attribute__((__sfr__));
__extension__ typedef struct tagIC2CON2BITS {
  union {
    struct {
      unsigned SYNCSEL:5;
      unsigned :1;
      unsigned TRIGSTAT:1;
      unsigned ICTRIG:1;
      unsigned IC32:1;
    };
    struct {
      unsigned SYNCSEL0:1;
      unsigned SYNCSEL1:1;
      unsigned SYNCSEL2:1;
      unsigned SYNCSEL3:1;
      unsigned SYNCSEL4:1;
    };
  };
} IC2CON2BITS;
extern volatile IC2CON2BITS IC2CON2bits __attribute__((__sfr__));

#define IC2BUF IC2BUF
extern volatile unsigned int  IC2BUF __attribute__((__sfr__));
#define IC2TMR IC2TMR
extern volatile unsigned int  IC2TMR __attribute__((__sfr__));
#define IC3CON1 IC3CON1
extern volatile unsigned int  IC3CON1 __attribute__((__sfr__));
__extension__ typedef struct tagIC3CON1BITS {
  union {
    struct {
      unsigned ICM:3;
      unsigned ICBNE:1;
      unsigned ICOV:1;
      unsigned ICI:2;
      unsigned :3;
      unsigned ICTSEL:3;
      unsigned ICSIDL:1;
    };
    struct {
      unsigned ICM0:1;
      unsigned ICM1:1;
      unsigned ICM2:1;
      unsigned :2;
      unsigned ICI0:1;
      unsigned ICI1:1;
      unsigned :3;
      unsigned ICTSEL0:1;
      unsigned ICTSEL1:1;
      unsigned ICTSEL2:1;
    };
  };
} IC3CON1BITS;
extern volatile IC3CON1BITS IC3CON1bits __attribute__((__sfr__));

#define IC3CON2 IC3CON2
extern volatile unsigned int  IC3CON2 __attribute__((__sfr__));
__extension__ typedef struct tagIC3CON2BITS {
  union {
    struct {
      unsigned SYNCSEL:5;
      unsigned :1;
      unsigned TRIGSTAT:1;
      unsigned ICTRIG:1;
      unsigned IC32:1;
    };
    struct {
      unsigned SYNCSEL0:1;
      unsigned SYNCSEL1:1;
      unsigned SYNCSEL2:1;
      unsigned SYNCSEL3:1;
      unsigned SYNCSEL4:1;
    };
  };
} IC3CON2BITS;
extern volatile IC3CON2BITS IC3CON2bits __attribute__((__sfr__));

#define IC3BUF IC3BUF
extern volatile unsigned int  IC3BUF __attribute__((__sfr__));
#define IC3TMR IC3TMR
extern volatile unsigned int  IC3TMR __attribute__((__sfr__));
#define IC4CON1 IC4CON1
extern volatile unsigned int  IC4CON1 __attribute__((__sfr__));
__extension__ typedef struct tagIC4CON1BITS {
  union {
    struct {
      unsigned ICM:3;
      unsigned ICBNE:1;
      unsigned ICOV:1;
      unsigned ICI:2;
      unsigned :3;
      unsigned ICTSEL:3;
      unsigned ICSIDL:1;
    };
    struct {
      unsigned ICM0:1;
      unsigned ICM1:1;
      unsigned ICM2:1;
      unsigned :2;
      unsigned ICI0:1;
      unsigned ICI1:1;
      unsigned :3;
      unsigned ICTSEL0:1;
      unsigned ICTSEL1:1;
      unsigned ICTSEL2:1;
    };
  };
} IC4CON1BITS;
extern volatile IC4CON1BITS IC4CON1bits __attribute__((__sfr__));

#define IC4CON2 IC4CON2
extern volatile unsigned int  IC4CON2 __attribute__((__sfr__));
__extension__ typedef struct tagIC4CON2BITS {
  union {
    struct {
      unsigned SYNCSEL:5;
      unsigned :1;
      unsigned TRIGSTAT:1;
      unsigned ICTRIG:1;
      unsigned IC32:1;
    };
    struct {
      unsigned SYNCSEL0:1;
      unsigned SYNCSEL1:1;
      unsigned SYNCSEL2:1;
      unsigned SYNCSEL3:1;
      unsigned SYNCSEL4:1;
    };
  };
} IC4CON2BITS;
extern volatile IC4CON2BITS IC4CON2bits __attribute__((__sfr__));

#define IC4BUF IC4BUF
extern volatile unsigned int  IC4BUF __attribute__((__sfr__));
#define IC4TMR IC4TMR
extern volatile unsigned int  IC4TMR __attribute__((__sfr__));
#define QEI1CON QEI1CON
extern volatile unsigned int  QEI1CON __attribute__((__sfr__));
typedef struct tagQEI1CONBITS {
  unsigned CCM:2;
  unsigned GATEN:1;
  unsigned CNTPOL:1;
  unsigned INTDIV:3;
  unsigned :1;
  unsigned IMV:2;
  unsigned PIMOD:3;
  unsigned QEISIDL:1;
  unsigned :1;
  unsigned QEIEN:1;
} QEI1CONBITS;
extern volatile QEI1CONBITS QEI1CONbits __attribute__((__sfr__));

#define QEI1IOC QEI1IOC
extern volatile unsigned int  QEI1IOC __attribute__((__sfr__));
typedef struct tagQEI1IOCBITS {
  unsigned QEA:1;
  unsigned QEB:1;
  unsigned INDEX:1;
  unsigned HOME:1;
  unsigned QEAPOL:1;
  unsigned QEBPOL:1;
  unsigned IDXPOL:1;
  unsigned HOMPOL:1;
  unsigned SWPAB:1;
  unsigned OUTFNC:2;
  unsigned QFDIV:3;
  unsigned FLTREN:1;
  unsigned QCAPEN:1;
} QEI1IOCBITS;
extern volatile QEI1IOCBITS QEI1IOCbits __attribute__((__sfr__));

#define QEI1STAT QEI1STAT
extern volatile unsigned int  QEI1STAT __attribute__((__sfr__));
typedef struct tagQEI1STATBITS {
  unsigned IDXIEN:1;
  unsigned IDXIRQ:1;
  unsigned HOMIEN:1;
  unsigned HOMIRQ:1;
  unsigned VELOVIEN:1;
  unsigned VELOVIRQ:1;
  unsigned PCIIEN:1;
  unsigned PCIIRQ:1;
  unsigned POSOVIEN:1;
  unsigned POSOVIRQ:1;
  unsigned PCLEQIEN:1;
  unsigned PCLEQIRQ:1;
  unsigned PCHEQIEN:1;
  unsigned PCHEQIRQ:1;
} QEI1STATBITS;
extern volatile QEI1STATBITS QEI1STATbits __attribute__((__sfr__));

#define POS1CNTL POS1CNTL
extern volatile unsigned int  POS1CNTL __attribute__((__sfr__));
#define POS1CNTH POS1CNTH
extern volatile unsigned int  POS1CNTH __attribute__((__sfr__));
#define POS1HLD POS1HLD
extern volatile unsigned int  POS1HLD __attribute__((__sfr__));
#define VEL1CNT VEL1CNT
extern volatile unsigned int  VEL1CNT __attribute__((__sfr__));
#define INT1TMRL INT1TMRL
extern volatile unsigned int  INT1TMRL __attribute__((__sfr__));
#define INT1TMRH INT1TMRH
extern volatile unsigned int  INT1TMRH __attribute__((__sfr__));
#define INT1HLDL INT1HLDL
extern volatile unsigned int  INT1HLDL __attribute__((__sfr__));
#define INT1HLDH INT1HLDH
extern volatile unsigned int  INT1HLDH __attribute__((__sfr__));
#define INDX1CNTL INDX1CNTL
extern volatile unsigned int  INDX1CNTL __attribute__((__sfr__));
#define INDX1CNTH INDX1CNTH
extern volatile unsigned int  INDX1CNTH __attribute__((__sfr__));
#define INDX1HLD INDX1HLD
extern volatile unsigned int  INDX1HLD __attribute__((__sfr__));
#define QEI1GECL QEI1GECL
extern volatile unsigned int  QEI1GECL __attribute__((__sfr__));
#define QEI1ICL QEI1ICL
extern volatile unsigned int  QEI1ICL __attribute__((__sfr__));
#define QEI1GECH QEI1GECH
extern volatile unsigned int  QEI1GECH __attribute__((__sfr__));
#define QEI1ICH QEI1ICH
extern volatile unsigned int  QEI1ICH __attribute__((__sfr__));
#define QEI1LECL QEI1LECL
extern volatile unsigned int  QEI1LECL __attribute__((__sfr__));
#define QEI1LECH QEI1LECH
extern volatile unsigned int  QEI1LECH __attribute__((__sfr__));
#define I2C1RCV I2C1RCV
extern volatile unsigned int  I2C1RCV __attribute__((__sfr__));
#define I2C1TRN I2C1TRN
extern volatile unsigned int  I2C1TRN __attribute__((__sfr__));
#define I2C1BRG I2C1BRG
extern volatile unsigned int  I2C1BRG __attribute__((__sfr__));
#define I2C1CON I2C1CON
extern volatile unsigned int  I2C1CON __attribute__((__sfr__));
typedef struct tagI2C1CONBITS {
  unsigned SEN:1;
  unsigned RSEN:1;
  unsigned PEN:1;
  unsigned RCEN:1;
  unsigned ACKEN:1;
  unsigned ACKDT:1;
  unsigned STREN:1;
  unsigned GCEN:1;
  unsigned SMEN:1;
  unsigned DISSLW:1;
  unsigned A10M:1;
  unsigned IPMIEN:1;
  unsigned SCLREL:1;
  unsigned I2CSIDL:1;
  unsigned :1;
  unsigned I2CEN:1;
} I2C1CONBITS;
